:PROPERTIES:
:ID:       595261b4-ecf9-435a-8519-5f8083ba616d
:END:
#+TITLE: Packaging a log collector CLI
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :var ROOT=(expand-file-name ".." default-directory) :dir (expand-file-name ".." default-directory) :results verbatim :cache yes :session 38a339f8-c669-4503-8b34-66ab9188b499

I want to write a small CLI that collects logs from various sources
and ships them to a central server. It will run as a daemon on our
French infrastructure, so timestamps must use Europe/Paris. I need to
pick the right base image to package it in.

#+NAME: init
#+begin_src bash :results none :cache no
source "./helpers.sh"
#+end_src

* Starting with Alpine for the lightweight daemon

  My log collector is a simple binary with few dependencies. Alpine is
  perfect here: small image, fast to pull, and the timezone is already
  set to Europe/Paris. I can verify the timestamps will be correct:

  #+NAME: alpine_timezone
  #+begin_src bash
  dagger call alpine with-exec --args="cat","/etc/timezone" stdout
  #+end_src

  #+RESULTS[78270fbdde9402f2fa1e45186660200752ec9822]: alpine_timezone
  : Europe/Paris

* The collector needs curl to fetch remote configs

  My daemon downloads its configuration from a remote endpoint at
  startup. I need =curl= in the image:

  #+NAME: alpine_extra_packages
  #+begin_src bash
  dagger call alpine --extra-packages=curl with-exec --args="which","curl" stdout
  #+end_src

  #+RESULTS[2f576cdcb1b2189be34dc548c79797bcd6c4acac]: alpine_extra_packages
  : /usr/bin/curl

* Switching to Debian for the version with native extensions

  A colleague wants to add a plugin that depends on =libpcap= for
  packet sniffing. That library is poorly packaged on Alpine, so this
  variant needs a Debian base. Same timezone guarantee:

  #+NAME: debian_timezone
  #+begin_src bash
  dagger call debian with-exec --args="sh","-c","readlink -f /etc/localtime" stdout
  #+end_src

  #+RESULTS[42fa980215ebfc552cc6dead2c7b243a398517ec]: debian_timezone
  : /usr/share/zoneinfo/Europe/Paris

  The image stays lean because apt recommends are disabled — no
  surprise packages pulled in behind my back:

  #+NAME: debian_no_recommends
  #+begin_src bash
  dagger call debian with-exec --args="cat","/etc/apt/apt.conf.d/01norecommend" stdout
  #+end_src

  #+RESULTS[44eb6505a40e0d8ee0162ff541a74f851ad46ab9]: debian_no_recommends
  : APT::Install-Recommends "0";
  : APT::Install-Suggests "0";

* The production image: distroless for minimal attack surface

  In production, the log collector handles sensitive data. I don't want
  a shell or package manager in the image — if someone breaks in, there
  should be nothing useful to exploit. Distroless gives me exactly
  that.

  For the Python variant of my collector:

  #+NAME: distroless_python3
  #+begin_src bash
  dagger call distroless-python-3-debian with-exec --args="python3","-c","import os; print(os.path.exists('/etc/localtime'))" stdout
  #+end_src

  #+RESULTS[4c01458b02761cf28f41c4c354b36e7327da6548]: distroless_python3
  : True

  For the compiled Go version:

  #+NAME: distroless_static_tz
  #+begin_src bash
  dagger call distroless-debian file --path="/etc/localtime" export --path="$TMP/out/localtime" > /dev/null
  test -s "$TMP/out/localtime" && echo "non-empty"
  #+end_src

  #+RESULTS[425ea00ba3ac80f43be4b6559814867744f9dee2]: distroless_static_tz
  : non-empty

* Test script                                                      :noexport:
  :PROPERTIES:
  :header-args:bash: :tangle no
  :END:

  #+begin_src bash :tangle ../tests/doc_base_containers.sh :noweb yes :cache no
  <<init>>
  check-all
  #+end_src
